{"review":"I was really moved by this book.  I felt the lose of a love in a family and the total destruction of a marriage and what \"could have been\" slowly slipping away from two people who had loved one another and they watched as the grew so far apart. I felt for the children who saw this tragedy take place right before their eyes.  Both parents literally destroyed. What I still question is why did she ever go into the parking lot in the first place.  I honestly believe he only was determined to end his own life and she stepped into the car to stop him and was hit by a bullet herself. I a waste of two young parents and two lost children. Great coverage and presented clearly. Thanks","domain":"books","label":"positive"}
{"review":"Most Cops are Criminals I really liked this book.  There needs to be more books like this because most cops are actually outlaws. I have long said that direct action needs to be taken against corrupt cops including all options.  If we don't fight back at least read more books like this one.","domain":"books","label":"positive"}
{"review":"Browsing the bookstore's true-crime section last month in search of a page-turner I hadn't already read, I spied an unfamiliar jacket: Paul LaRosa's TACOMA CONFIDENTIAL.  The synopsis was riveting.  I only hoped the reading would be half as good as the compelling details promised. It was.  But an even bigger surprise unfolded as I progressed through the first chapter.  LaRosa can write.  Where has this guy been hiding?  All throughout, I was keenly aware of his sensitivity to the overall politics involved. And you can be sure that, where the chief of police murders his wife, political intrigue seethes through every line.  Yet LaRosa never milks it, or takes liberties or cheap shots where plenty of opportunities abound for same.  Quite the contrary, what the author DOESN'T say, divulge or speculate but only hints at, speaks a lot louder.  Understatement, I maintain, is extremely sexy in an author.  Who can resist a subtext which says: you're an intelligent reader, connect the dots yourself. The problem with finishing a book at 3:00 a.m. is you can't talk about it with anyone.  The best I could do was recommend Tacoma Confidential to my bookworm friends and urge them to read it - fast.  I needed meaningful discourse. There's nothing so delicious as getting into the details of a book with other readers and discovering how totally different they may understand or explain them. I appreciated LaRosa's inclusion of an interesting and extremely plausible alternate theory of the murderous event toward the end of his story.  It's an incredibly generous debunking of the purported nefarious motives ascribed to both of the main players.  The theory not only sets the conditions for healing, it provokes an entire reinterpretation of the facts.  Good stuff, Paul. My recommendation:  Read this book.  It's satisfying on many levels.  A good story, interesting facts, absorbing characters.  Suspenseful for sure.  And if good writing turns you on, well, that's an extra bonus. Therese Hercher","domain":"books","label":"positive"}
{"review":"The detailed research has resulted in a wonderful narrative which makes a great read. The sad story of these star crossed partners is very detailed and worth the price of the book.","domain":"books","label":"positive"}
{"review":"David Brame was a chief of police who committed at least one rape of a woman other than his wife--whom he raped repeatedly---and terrorized certain members of his department, mostly the women.  He harassed and tormented his wife. This book could benefit from a little feminist perspective. In fact, it's not that shocking to find some cops are wife-beaters; it's a macho culture.  Nor is it shocking to find a chief of police beating his wife----to whom, after all, would she report him? His own department?","domain":"books","label":"negative"}
{"review":"Paul LaRosa did such an extensive investigation it was as if he was there himself watching this brutal marriage and the lives and death of David Brame and his wife Chrystal. You can't put this book down for minute. So  much research in the details of this horrible crime,from the family to David's Co workers to everyone around the both of them.  Paul Larosa is an incredible author and can't wait to read his next book. This book is a must read","domain":"books","label":"positive"}
{"review":"LaRosa has done an excellent job of presenting the facts of this tragic case in concise, easy-to-read detail.  I grew up in Tacoma and one of my closest childhood friends was one of the first Gig Harbor police officers on the scene.  LaRosa's account of the events leading up to Crystal Brame's murder and David Brame's suicide meshed completely with what was going on behind the scenes that only the police knew about at the time.  Tackling the issue of spousal abuse is never easy; it's even more difficult when one of the parties involved is in a high-profile position of power. What could have easily been a cumbersome, he-said/she-said book became a solid true crime story through LaRosa's obviously well-researched words.  The area, the people and the aftermath were vividly portrayed.  I highly recommend this book","domain":"books","label":"positive"}
{"review":"I had never heard about this case so I didn't know what to expect when I started the book.  It immediately had a \"you are there\" ring to it because of the easy flow and the details and descriptions.  It read like a novel.  This is such a sad story, especially for the children.  How sick does a man have to be before somebody notices and does something about it?  Do these psychopathic men really hide their evil so well?  I can think of Scott Peterson, of course, and Laurie Hacking's husband, as well as others -- and David Brame fits right in with them.  Nobody notices the sickness in these men until it is all over and their wives are dead?  It is so sad.  In any case, this was a very well-written book and I am going to check to see if Paul LaRosa has written any others","domain":"books","label":"positive"}
{"review":"Mr. LaRosa has done a very good job of laying out the information, in a balanced manner, concerning a tragic incident that had a very convoluted and contentious history.  He also rightly raises important questions that remain in the aftermath and deserve to be asked.  This book is well-written and its reading moves quickly","domain":"books","label":"positive"}
{"review":"The Brame murder/suicide was big news in this area for a long time.  I didn't really expect to learn too much new from a book.  However, I did learn a lot.  The author has done extensive investigation into the circumstances of the marriage, separation and relationships of this couple.  The book was more balanced than I would have expected too.  In general, the story has been told with all the good on the side of Crystal and all the evil on the side of David.  This book told the other side too, in case the reader wants to make up his/her own mind.  The theory at the end about how the shootings occurred was interesting and made sense to me.  Well worth reading","domain":"books","label":"positive"}
{"review":"This review refers to the Penguin Classics edition of Henry Mayhew's 'London Labour and the London Poor' which is an abridged version of the original four volume version published in 1851-52. Though Henry Mayhew wrote several novels, his name is primarily remembered as the author/complier of this journalistic work 'London Labour and the London Poor.'  The present selection gives the best part of the original four volume book, which captures exactly what the title says -- London labour and the poverty-stricken people living there. The selction includes some figures or statistics about the working class people, such as the estimated amount of money these workers gain every day (and meagre one), but the most interesting part is the first-hand records about the ways of life of various lines of works in London, directly taken from the people engaged in these works. The jobs (and some of them  hardly deserve the name 'jobs') recorded here are, to name a few, street-sellers such as fried fish, watercresses, matches, baked potatoes, etc.; street-buyers such as old clothes or 'dust'; street-performers like 'conjurors,' musicians, or fire-eaters (with his own descriptions about how to eat fire), but the most fascinating is the records about boys (and some girls) who run away from parents, and lives in the street of London, who literally lives by begging or stealing. Many interesting facts are recorded by Mayhew (or his assistants), directly from the persons the book deals with, and the original words spoken by there labourers are preserved as much as possible.  To read, or to listen to them is one of the greatest merits of the book, for the languages of the interviewees retain the peculiar speeches you find in many Dickensian characters, and in fact you will realize that Dickens didn't exaggerate when he created Sam Weller. And the London you see here is the London Charles Dickens knew.  What did Jo in 'Bleak House' was sweeping in the street?  Who gave that permission?  What is the nature of 'the dust' you hear in 'Our Mutual Friend'?  What was the regulations of the 'workhouse'?  All these thing are answered in this vividly realized collections of the Victorian working class portraits. This book is still a valuable source for anyone who is interested in Victorian period, and will be.  Buy one now.","domain":"books","label":"positive"}
{"review":"Henry Mayhew, founder of Punch magazine, wrote this four-volume  sociological classic during the 1850's.  If you are at all interested in  the Victorian era, in British history, in London, or in urban history in  general, this is a must-read.  The Penguin version is abridged and is a  distillation of the &quot;best&quot; of the multiple-volume set.  This  distillation is itself over 500 pages, so imagine the impact of the entire  set!  The utter destitution of the London poor is set out in such vivid  detail than one cannot help being shocked at the conditions human beings  were forced to live in in the greatest city of its time.  The only fault I  find with this book is Mayhew's occasional lapses into preaching.   Otherwise a fine boo","domain":"books","label":"positive"}
{"review":"I really enjoyed this book and thought some of the theories were monumental. Maybe we are just a simulation right this moment, we do not know. Actually the vibration we are is a simulation from stillness, MAYBE? This was over all a good and interesting read, some pieces were a little scientific for the layman but struggle through, its worth the read","domain":"books","label":"positive"}
{"review":"Even though the book is controversial and presents ideas and theories that will appear far-fetched and unproven, it is still worth reading.","domain":"books","label":"negative"}
{"review":"Imagine the entire cosmos conquered by nanotech self-replicating machines?  That's just one of the far-out ideas to chew on in this book.  Even if the whole theory doesn't hang together, a lot of the parts are extremely interesting. Note: Readers without a background in science or engineering will find this tough going","domain":"books","label":"negative"}
{"review":"while I appreciate what Tipler was attempting to accomplish, he fails miserabley both from a theological and a scientific perspective.  skip this one!","domain":"books","label":"negative"}
{"review":"Tipler says that he used to be an unquestioning atheist, but his work in quantum cosmology has brought him to the conclusion that there is a physically justifiable theory of how \"God\" and \"immortality after death\" might make sense. I only skimmed the book, but I have to say that, as a physicist, I was surprised to find the quality of his arguments to be a lot better than I expected. (Talk about having \"proved\" the existence of God is greatly overstated. It would be more accurate to say that, if certain physical conditions could be shown to hold, then the existence of something vaguely like God might be remotely plausible based on his arguments. But see the end of this review.) The compressed version of the theory is... Tipler (as I do) subscribes to the \"strong Artificial Intelligence\" belief that if you translated the dynamics of what goes on in our brains into another medium (e.g., a futuristic computer), in a sense it wouldn't make any difference -- our \"emulated\" selves would be as conscious and real as we are. He outlines a scenario under which, in a closed universe, in the final moments of the universe, there could be an infinite amount of computing that occurs. So much in fact, that all the human lives that ever occurred (or ever could have occurred) could be emulated through infinite subjective time. The computing entities that exist at the end of the universe would get there via exponentially replicating intelligent machines that we (or conceivably another intelligent race) send out into the universe. Based on game theory and economic arguments, he makes it plausible that the intelligences at the end of the universe would be highly altruistic. And then based on quantum cosmology, he argues for bidirectional causality between here and the end of the universe (I haven't digested that argument). Not exactly something most traditionally religious folks would recognize. But, as a theory of how \"God\" and physics could be merged, to my mind it's pretty brilliant. (Doesn't mean it's right.) Note, however, that the book was written in the early 90's. Tipler provides some experimental tests one can do to assess whether or not we're in a universe where the conditions are right to make his scenario possible. One of the most important tests -- verification that we're in a closed universe -- has already been answered (we seem to be in a defiantly open universe) in a way that implies we are NOT in a universe where Tipler's scenario could hold true. Still, very interesting reading","domain":"books","label":"positive"}
{"review":"Tipler says many times \"as I have proved\".  Huh? What the f is he talking about?  There is no proof in this stinking pile of filth.  He's got an abundance of physics in the back of the book-I'd like to hear from a physicist if any of that crap makes any sense, but I don't think it should matter.  I am intelligent enough to understand basic physics concepts, and Tipler just doesn't make any sense.  His writing is so bad that anyone who reads this entire thing will have wasted a colossal ammount of time.  The more books you read, the sooner you know when to stop reading, put the book down, and read a work of fiction instead, which can play with such ideas without boring you to death","domain":"books","label":"negative"}
{"review":"I ran across this book at a local library and it picqued my interest.  Tipler's theory of immortality, in a nutshell, is the following: 1) the planet earth...and all its living creatures are doomed as the sun will engulf the earth in ~1 billion years. 2) Man will make self-learning and self-replicating machines (can Windows XP do that?) that will colonize, over millions of years, our galaxay and, eventually, the entire universe. 3) These machines will be capable of individual thoughts, emotions, etc and are essentially \"alive.\" 4) As the universe begins to collapse, the machines will be able to manipulate this collapse and prevent total destruction of the universe. 5) All the knowledge possessed by these machines will eventually coalesce into one \"super being\" at the center of the collapsing universe...this super being is the \"omega point.\" 6) The omega point, via its \"all knowledge of all things\" will be able make emulations (exact duplicates) of all biospheres, including earth.  Within these emulations, individual humans (you and me!) will be emulated.  Thus we will again be \"alive\" as these \"beings\" in these emulations will be unable to tell if they're real or virtual....PRESTO...immortality for all.  The book (theory) reeks of circular logic and assumptions.  It's an interesting theory, but it's just that, an interesting theory by a theoretical physicist.  PS: Tipler denies the resurection of Christ and in  the last chapter admits to being an aetheist.  (I wonder if he's a God-fearing aetheist?","domain":"books","label":"positive"}
{"review":"One of the top five, if not the most interesting book, I have ever read. If you are familar with any Omega point theories, this is another one, but Tipler attempts to incorporate more traditionaly Christian elements as opposed to Hegel or Spinoza-like view of reality. I am not a religious believer myself, but if you have even the slightest interest in how a traditional theology might be merged with science, this book is definitely worth your attention","domain":"books","label":"positive"}
{"review":"There are some great courtroom scenes in this movie that are so powerful and the acting is fantastic. The story of honor and pride in one's country and way of life is an inspiration for anyone who is a believer in truth, justice and the American Way","domain":"dvd","label":"positive"}
{"review":"The military courtroom drama,\"A Few Good Men\" is one of those films, that through endless cable showings seems to have taken a life of it's own. But even with countless viewings it retains it's emotional power and speaks to us about issues, that have become more important than ever. In the film we meet Lt. Daniel Kaffee (Tom Cruise) a young successful, military lawyer, who is considered so slick at plea bargaining out cases, that supposably he's \"never even seen the inside of a courtroom\". He is assigned the cases of PFC Louden Downey (James Marshall) and Lance Cpl. Harold Dawson (Wolgang Bodison). They are accused of murder and a host of other charges, when at the Guantanamo Bay military base they performed a \"Code Red\" (an illegal form of discipline within a military unit) on Pvt. William Sandiago, which unintentionally resulted in his death. While the two accused Marines admit they did the \"Code Red\", both claim they were under orders to do so by their superiors, which includes Base Commander, Col. Nathan Jessup (a brillaint Jack Nicholson) a powerful, highly decorated officer, who is being groomed for one of the top slots in the military command. With both time running out and a lack of legal evidence, Kaffee must get to the bottom of a conspiracy and present his case, even if it means putting his own career in jeopardy. Through a brilliant script (based on the play by Aaron Sorkin), Rob Reiner's steady direction and the cast's dynamic performances this film looks at the meaning of highly held military principles such as \"code, honor & discipline\". Should a soldier always follow orders no matter what? Whats' more important our ethics & principles (on which this country was founded) or our need for security? Is Col. Jessup right? Can we not \"handle the truth\"? It's hard to believe, that this film was made way back in 1992. In this post 9/11, post Abu Grebbe world, where our country is on a war footing the questions, that the film seeks to address have become more profound and important than ever. The film is filled with great performances. While I am not normally a huge Tom Cruise fan, I have to admit, that Cruise does a wonderful job as the young conflicted lawyer. The same goes for the great supporting cast which includes good acting turns from Demi Moore, Kevin Bacon and Kiefer Sutherland. But what really propels and turns this film into a classic is the brilliant, dynamic performance, that comes from Jack  Nicholson. When Cruise puts Nicholson on the courtroom stand and starts pointly egging him on, you just watch in awe as Nicholson just continually builds the character's palpable anger, until he just boils over and explodes in the now infamous \"You Can't Handle the Truth\" speech. Even though the speech and Nicholson's performance has been endlessly quoated & parodied, when you put it in the context of this movie it still has so much power and resonance. If you are interested in seeing a well made, movie courtroom drama, that is both thought provoking and entertaining then I highly recommend \"A Few Good Men\"","domain":"dvd","label":"positive"}
{"review":"This documenty will probably be the \"darkest\" DVD WWE will ever release because Jake Roberts himself is a very dark man.  They hold nothing back here as they do deep into his life and every aspect of it which honestly, it's not safe for children and this DVD itself is something that should have been rated TV-MA.  Pick Your Poison is an approprate title for this DVD set. The documentry starts with Jake Roberts story of growing up and dealing with problems abusing women, and going from home to home.  Him getting into wrestling via his father Grizzly Smith and his early days in promotions are glossed upon all the way up to him getting involed in NWA Mid-Altantic Wrestling.  Jake Roberts invention, the DDT, is talked about and the story of his it came to be.  His time in Georgia Championship Wrestling along with his fued with Ronnie Garvin is touched upon before they move on to him going back to Mid-Alantic before quitting there as well.  His debut in the WWE is talked about starting with his fued with him & Damien \"the snake\" against Ricky Steamboat and his lizard including the DDT Ricky on the concrete from Saturday Night's Main Event.  His interview segment \"The Snake Pit\" is talked about along with Jake's interview skills & the fact that he never had to raise his voice to get his point across.  His fued with Honky Tonk Man, how that started his drug addiction, and his match at WM3 with Alice Cooper is touched upon along with how he was a becoming a big star in the WWE.  His fueds with Ted Dibiase over the Million $ Belt along with his real life wife's involvement with the Rick Rude fued are discussed.  Here the docuementy starts to get more personal as Jake talks about his drug addiction.  From there, stories are told about Damien the snake & his fueds with Andre The Giant & his fued with Earthquake which resulted in the \"death\" of Damien.  Jake then goes into the backstage story behind his fued with Ultimate Warrior and how come nothing ever happened past the vignette's that were filmed.  His fued with Randy Savage is glossed over before they go into the story of how he left WWE after WrestleMania 8.  His brief history & story behind his entrance & exit in WCW was talked about before he returned to WWE a religious man...and how that faith planted the seeds for Austin 3:16.  His fued with Jerry Lawler is discussed and how it personally effected him to the point to where he left WWE again.  His appearence on Beyond The Mat was discussed along with his 30 second cameo at ECW's Hardcore Heaven '97 is talked about.  The documentry closes out on Jake discussing stories that have been printed about him for the past couple of years and his appearence on RAW before WM21. Also on this disc are various interview outtakes where Jake talks about his relationship with children, how he became \"The Snake\", a meeting with NBC Executive Dick Ebersol, how he turned King Kong Bundy babyface, and why his fued with Hulk Hogan didn't go far.  Other wrestlers speak on various subjects such as Hogan also giving his point of view in his short fued with Jake along with a hidden story about a drive with Jake's dad Grizzly Smith, other wrestlers speak on Grizzly, and Ricky Steamboat tells a story about Damien in the shower & scaring the crap out of all the wrestlers in the locker room. The matches itself are split among the two disc:  Disc one includes Ricky Steamboat in The Snake Pit match (basically no disqualification); his WrestleMania 3 match against Honky Tonk Man, a \"Rude Awaking vs. DDT\" match against Rick Rude.  Disc two features a tag team match with Ricky Steamboat and matches against Ronnie Garvin, Lanny Poffo, Sting in a Coal Miner's Glove match (Halloween Havoc), Dirty White Boy, Steve Austin in the King Of The Ring final, Jerry Lawler at SummerSlam, and with Tommy Dreamer vs. Justin Credible & Jack Victory at November 2 Remember '98.  They also have vingette's featuring Earthquake \"killing\" Damien, Jake's cobra biting Randy Savage, his run-in during the Tommy Dreamer/Jerry Lawler match, a TNT interview, Rick Rude hitting on Cheryl Roberts, an interview with Mean Gene, two appearences on the Brother Love show, four Ulitmate Warrior promos, an promo featuring various snakes, and an hidden interviews featuring Ricky Steamboat and another one before his match with Ronnie Garvin.  Rounding out this DVD set are 3 Snake Pit episodes featuring Kamala, JunkYard Dog, and Hulk Hogan. Overall, a great DVD collect for those who were fans of the legend and good for those who want to know about the effects of the \"dark side\" of the business","domain":"dvd","label":"positive"}
{"review":"I didn't think @ the time that they were going to release a DVD on Jake Roberts. But after I watched this the first time, I'm glad they did. First things first, Jake Roberts, no matter what kind of personal problems he may have had in the past, the guy is a TRUE legend. This DVD is as in depth as any WWE DVD I've recently purchased. It gave me certain information about Jake that I didn't previously know. The documentary portion of the DVD is awesome, and it's required viewing for all fans, especially long time fans like me. Here's my review on the extra matches: Disc One Matches vs. Ricky Steamboat, Snake Pit Match - The Big Event 8/28/86, ***1/2 (Jake and Steamboat had a great feud around this time, and this is one of the highlights of that feud. One of Jake's best matches.) vs. Honky Tonk Man - Wrestlemania III 3/29/87, *1/2 (Still a shocking upset to this day, Honky Tonk beat Jake in this match, still watchable though.) vs. \"Ravishing\" Rick Rude, Rude Awakening vs. DDT Match - MSG 10/24/88, ** (Another great feud during this time for Roberts. Rude was after Jake's wife @ the time, and the result was a HOT storyline, Jake got the win in this one.) Snakes Bites (Extras) Jake's relationship with children How he became \"The Snake\" Working with Dynamite Kid Legion of Doom \"Steamboat saved my life...\" Meeting Dick Ebersol \"Snake\" on the loose... Grizzly Smith Hogan/Jake Feud Easter Eggs on Disc One In the Chapters section, click right twice on \"Growing Up\" for Jake telling a personal story about being worked by his father after a match In the Snake Bites section, click right twice on \"Legion of Doom\" for a clip of Animal finishing the story he started about King Kong Bundy on the Snake Bites clip In the Snake Bites section, Click left twice on \"Grizzly Smith\" for a clip of Hulk Hogan talking about an experience he had with Jake's father on a road trip. Disc 2 - Matches: w/ Ricky Steamboat vs. Jim Nelson & Mike Miller - Mid-Atlantic, 9/9/81, *1/2 (Average match, but watchable.) vs. Ronnie Garvin, World TV Title - Georgia Championship 12/3/83, ** (Not a bad match, but they did show some energy in this one.) vs. \"Leaping\" Lanny Poffo - MSG 3/16/86, *1/2 (Jake's debut match in the WWF. Pretty average to say the least.) vs. Earthquake - Superstars 4/27/91, (No match. Once things appear to get going, Earthquake \"squashes\" Jake's snake in the bag, actually sitting on it.) After a match, Jake \"The Snake\" Roberts attacks Randy \"Macho Man\" Savage with a cobra - Superstars 11/23/91 vs. Sting, Coal Miners Glove Match - Halloween Havoc 10/25/92, *1/2 (Another fairly average match. Worth a look to see Jake face Sting for the first & last time.) vs. Dirty White Boy, Smokey Mountain Title - Smokey Mountain Wrestling 5/7/94, * (Not very good, but semi-ok.) vs. \"Stone Cold\" Steve Austin - King of the Ring 6/23/96, ** (If it wasn't for this match, there would be no Stone Cold Steve Austin, bottom line. Watch Austin's promo @ the end of this match.) vs. Jerry \"The King\" Lawler - Summerslam 8/18/96, DUD (Pretty much a squash almost, Jake quickly disposes of Lawler with the DDT.) Run-in during Tommy Dreamer vs. Jerry \"The King\" Lawler - Hardcore Heaven 8/17/97 w/ Tommy Dreamer vs. Justin Credible & Jack Victory - November 2 Remember 11/1/98, ** (This is your standard ECW match.) Interviews & Promos: Vince McMahon interviews Jake - TNT 3/14/86 \"Ravishing\" Rick Rude hits on Cheryl Roberts - Superstars 4/23/88 Brother Love interviews Jake & Cheryl Roberts - Wrestling Challenge 1/27/90 Promo about threatening Ted Dibiase with snakes - Superstars 3/3/90 Fights with Brother Love during interview - Superstars 10/27/90 Interview on The Barber Shop - Wrestling Challenge 5/11/91 Ultimate Warrior Casket Vignette - Superstars 8/3/91 Ultimate Warrior Cemetery Vignette - Superstars 8/10/91 Ultimate Warrior Snake-Filled Room Vignette - Superstars 8/17/91 Mean Gene Okerlund interviews Jake - Superstars 3/14/92 The Snake Pit: w/ Kamala, The Wizard & Kim Chee - Wrestling Challenge 9/6/86 w/ Junkyard Dog - Wrestling Challenge 10/18/86 w/ Hulk Hogan - Wrestling Challenge 11/22/86 DVD Bonus: Excerpts from various books by WWE Legends including: Superstar Billy Graham \"Tangled Ropes\", Jerry Lawler \"It's Good to Be the King... Sometimes\" & Freddy Blassie \"Listen, You Pencil Neck Geeks\"! Disc 2 Easter Eggs Click left twice on \"with Ricky Steamboat vs. Jim Nelson and Mike Miller\" for a Steamboat and Roberts promo regarding this match. Click right twice on \"vs. Ronnie Garvin\" for a Gordon Solie interview of Paul Ellering and Jake Roberts from Georgia Championship Wrestling. Cleck left twice on \"vs. Earthquake\" for a clip from Superstars on April 6th, 1991 where Roberts spooks Tenta and Jimmy Hart with the snake Overall, I have a few comments: #1) If you want this DVD for the matches ONLY, and you're looking for quality and you're not into the old school wrestling, this DVD is not for you. #2) If you're a nostagic fan, such as myself, and you like the classic WWF footage and matches to boot, high recommendation. #3) If you're just a fan of Jake Roberts, overall, another high recommendation. In the end, you won't go wrong with this purchase","domain":"dvd","label":"positive"}
{"review":"This DVD really lets you in on the insight of Jake Roberts.  He was one of the most unique characters in his heyday and with his commentary on this it really stands out tremendously.  The kind of things I learned from him (especially in his youth) and his drug and alcohol abuse, he grew up rough in every sense of the word. Now I have a better understanding of why/how he became bitter (at times).  Overall, it's an excellent DVD that has most of his classic matches.  When I first saw him get hit with the guitar by the Honky Tonk Man, I thought he was faking the shot to make it look real and I even laughed at it until he said that guitar was 1/2 inch thick and then I looked at the clip again and I thought damn, it really almost killed him. He had a lot of guts to continue to wrestle.  That type of commentary along with other things he touched up on really gave it a sense of realism of the pro wrestling lifestyle.  Overall, I recommend this DVD to add to your collection.","domain":"dvd","label":"positive"}
{"review":"Awesome DVD! Jake Roberts tells you everything from origin of the DDT to the drug addiction to the last time he appeared on WWE television. This is definitely a must have! Jake the Snake is a true legend and deserves to in the Hall of Fame. Maybe it will happen in 2006","domain":"dvd","label":"positive"}
{"review":"At first I wasn't going to buy this dvd.  I didn't really care or know a whole lot about the career of Jack Roberts.  Then I saw it Used at a local Game Stop store.  For $11 I couldn't refuse.  The doc. is GREAT, I knew that he does or did drugs, I learned alot about the Man and his hard up bringing.  As for the extras there are tons I found three or four hiddden easter eggs.  If you can find this Used BUY IT.","domain":"dvd","label":"positive"}
{"review":"A stroll down memory lane, with one of the most interesting wrestlers. By far, it was worth 5 stars. If I had any complaint, it would be be overuse of the \"younger Jake\" double drinking at the bar and popping pills. A few times got the point across. They could have used that time to throw in a couple more Snake Pit segments as extras. No one is ever happy with all the matches presented, of course, or all the footage. The only two bits I would have liked to see was that blindfolded versus blindfolded Rick Martel and Jake Roberts match, and also footage from the one Saturday Night's Main Event, when Honky Tonk Man dressed as Kimchi and attacked Jake, but then later, at the end, when Jake got his revenge with Damion. Still, excellent fun! My only other question now is, where the hell is a ROWDY RODDY PIPER DVD?","domain":"dvd","label":"positive"}
{"review":"The first time I watched In Good Company I said to myself, eh not good, not bad, just pretty average. A couple reviews reflect that. But ever since HBO started playing the movie constantly I find myself watching it more and more and enjoying it more and more. The best quality about this film is that it's real. You watch the story progress and you feel like you're watching reality. I never found myself saying, how unrealistic, that could never happen. The character's emotions seem real, the situations seem real. That all points to a well-acted, well-written film. Also, the movie doesn't try too hard. It doesn't go out of its way to be funny, doesn't go out of its way to give you a sappy, predictable ending or stupid scenarios that so many movies end with. Just an interesting plot that flows and moves along with realism in mind instead of Hollywood fantasy","domain":"dvd","label":"positive"}
{"review":"Not a typical no brainer movie.  This movie presents complex people with complex motives.  Topher Grace is effective as the successful executive who can impress top ranking executives, yet has an undeveloped personality in many ways.  He is still trying to find out who he is and what he wants in life.  This lack of maturity and goals costs him his wife.  He focuses on his job even though he isn't passionate about the work.  Quaid does not like his demotion, yet he tries to be fair to his new boss and doesn't try to sabatoge him. This is where the film differs from other, inferior movies.  He is unhappy about his new status but tries to make the best of it.  He even tries to help his new boss.  The love story is played with honesty since Quaid's daughter is too young to commit hereself to anyone, yet she's attracted to her dad's new boss.  Don't expect cheap laughs and simple answers","domain":"dvd","label":"positive"}
{"review":"I always this dislike those raunchy humor comedies(always with some expections like Harold and Kumar), many to list but In Good Company is a very original movie and fits perfectly as comedy and drama there is  never a dull or slow moment in the whole movie all the chacters  are likeable,Topher is a pretty good actor and he has  a great future as a comedian(by the way i think Topher is a great choice for  Eddie Brocks in Spider-man 3)he is very funny in \"That 70 Show\" too, Scarlett was excellent(i never see a bad movie from her), with no dobut one the best young actress in the actual hollywood,the story is great and original,drama works fine the direction also is very good and the movie skips any raunchy joke,in my opinion In Good Company by far is one the best comedies i ever seen and one my favorites comedies too,i gonna buy my copy! acting: 10/10 direction: 10/10 story 10/10 Overall 10/1","domain":"dvd","label":"positive"}
{"review":"Dennis Quaid ranks high in our family video night; both the Parent Trap and the Rookie are among our young children's favorites.  For my wife and I, I rented In Good Company due to Quaid, and because the film intrigued me: its trailer and synopsis do not rely on quick action or screwball comedy.... it was different from most of what I see. In Good Company relies on its characters.  I don't know the corporate world, but as corporations seem to be today's \"Resident Evil\" (pun intended), I liked a story where a heart is found in the Oz less world of layoffs and cubicles.  What I liked most was the interaction between Dan Forman, played by Quaid, and Carter Duryea, played by Topher Grace.  Carter is fatherless; basically he's parentless, and the film shows a close Foreman family but has little, and little positive, reference to Carter's upbringing. Carter's world is psyche, synergy, cell phones and Sports America, where he now runs sales.  As the film progresses we are treated not just to an old school/new school, hip/over the hill tension, but see a young man learn character, in work and family, from someone who has done it right. There are limitations, as when Foreman tells Duryea that the secret to a good marriage is to find the right woman and keep your organ in your pants when you are away from home.  This is not too helpful for Carter, whose seven-month marriage to the wrong woman shows a need for more than luck. But overall he learns that life is more than suits, cars, and success... he longs for he does not have.  Throughout we see the pain of a young man all alone in the world, someone who has had no one to guide him. In one scene, Morty, played by David Paymer, states that the right timing is important. The film could easily have dived into a happy ending where everyone has a job and  where Carter gets the girl, but it makes a good move by remaining true to that line.  When Carter hugs Foreman goodbye he squeezes him and breaks down. When we next see Carter he is jogging outside rather than on a treadmill. He may not know where his path will lead, but now, thanks for Dan Foreman, he is no longer running in circles.","domain":"dvd","label":"positive"}
{"review":"Upon seeing previews at the theater for In Good Company, my first instinct was to avoid it like the plague.  Based on the apparent target demographic for this film, it was marketed horribly.  The trite title and kitchy manner in which the preview clips were edited reminded me too much of those shallow adoloescent throwaway Disney films - the type hollywood routinely pukes out for 14 year old girls.  And knowing Dennis Quaid's penchant for appearing in such films, I assumed In Good Company was another one of those. Recently however, I stumbled across the movie's opening credits on HBO.  \"I'll stay long enough to make fun of it.\", I thought to myself.  But in a matter of minutes, I was completely sucked in.  The writing was intelligent and the tone often dark.  This is a movie that, on the surface appears to be a natural born comedy, yet it resists the obvious cornball pitfalls at every turn. The characters are not 1 dimesnional buffoons, but are written to be very believable people with real problems.  Every time I smelled a cliche or overly sentimental twist coming, the film continued to surprise me by not taking the easy way out. Is it a perfect film?  No.  In Good Company is not without its flaws.  But they are very few and very forgivable.  This one is proof that you can't judge a DVD by its cover","domain":"dvd","label":"positive"}
{"review":"In Good Company isn't a hilarious comedy, nor a serious, \"edge-of-your-seat\" drama - yet something about it made it one of the most absorbing movies of 2005, pleasantly fascinating and easy to watch.  The story is about a middle-aged sales exec (Dennis Quaid) who's company is sold, with over-night demotion and a new boss (Topher Grace), a young whipper-snapper half his age and pathetically callow, though exuding infectious confidence and ambition of youth.  The new boss even naively falls for his older worker's daughter, oblivious to the obvious impracticality. So without a lot of hilarious comedy nor a suspenseful plotline, what makes In Good Company so interesting?  Two things I think.  One, the movie starts out with a premise that lends itself to extremely cynical comedy (like the Simpsons), but very realistically and gradually rises above that temptation to a conclusion that's uplifting in spite of the realistic situation.  Second, the unusual platonic chemistry between the two male leads seems real and strangely appealing, like you want to know these people and root for their friendship.  You don't see that done well in the movies often, and this is probably the most effective case since Cary Grant and Ronald Coleman in Talk Of The Town (in which they were in a romantic triangle with Jean Arthur, so it's really not the same situation). I'm afraid you'll just have to watch the movie to see what I mean","domain":"dvd","label":"positive"}
{"review":"I loved this movie. The acting was great and the their interactions throughout the movie interesting. Its amazing how some movies just don't have the ability to keep my interest but this one definitely pulled me in right from the start and built as the movie progressed. Very enjoyable and with some good laughs.","domain":"dvd","label":"positive"}
{"review":"I wanted to see a movie one evening, and it really didn't matter what movie, I just wanted to get out of the house, and get to a theater. I looked at the listings and decided to see \"In Good Company\", and I'm certainly glad I did. I found this movie to be very entertaining, and very enjoyable to watch. I thought this movie really showed a new edge to Scarlett Johansson as well. In a way this movie was also an eye-opener on todays' corporate America, and its' all too often pitfalls. Nicely produced, acted, and directed.","domain":"dvd","label":"positive"}
{"review":"\"In Good Company\" goes on and on at the end a little bit, and the ending especially is not fulfilling character/plot-wise.  If it had ended 15-20 minutes before it actually did, I would give it three stars instead of two. I admit there were quite a few times when I laughed a bit to myself, but it didn't make me fall off the couch or anything. There were other times when I thought the actions of some characters were weird or forced. Overall it isn't an entirely bad movie, but, like I said, the ending is unfulfilling.  Overall not strong performances coming from Scarlett Johansson or Topher Grace","domain":"dvd","label":"negative"}
{"review":"These are not the original theatrical realeases. In addition to the changes made in the special edition versions of the films, American Cinematographer noted in their review of the DVD release that they had gone so far as to change the color-timing of the transfer so that the color scheme more closely resembled the more recent prequels. Though they are an impressive technical achievement, I'll be buying the academy award winning films that I saw when I was younger","domain":"dvd","label":"negative"}
{"review":"The Star Wars Trilogy are my favorite movies of all time, to be able to own the first edition of it's DVD release is a Star Wars fan's dream come true","domain":"dvd","label":"positive"}
{"review":"These films look really good cleaned up, only thing George shouldn't of changed/added was the Greedo/Han scene in episode 4, the Han walking over Jabbas tail scene in episode 4, and the change to the end scene in episode 6 at the end where yoda, obi-wan, and anakin are all standing together smiling at luke. Replacing the old darth vader with the actor from episode 3 was just plain out dumb.","domain":"dvd","label":"positive"}
{"review":"Does just what it says it will do.  Was easy to install.","domain":"electronics","label":"positive"}
{"review":"I've had this hub for two months and have had no problems with it. Installation was a snap, as it should be for a basic hub. The hub is small and a bit too light, but it's definitely not for laptop users, as it needs an AC adapter.  The power brick is actually smaller than most other brick-style adapters and rises straight up from the prongs, saving you space on power strips that have the plugs aligned vertically or on wall outlets (a nice touch). I have an iPod and a multifunction printer attached to the hub, and have had no problems with either.  A word of warning, however--as other reviewers have noted, if you plug a USB 1.0 device into the hub, all USB 2.0 devices will slow down to 1.0 speeds","domain":"electronics","label":"positive"}
{"review":"This is very well designed. It give you 4 USB Port but two on opposite sides. This is very clever becase you have plug in devices from both sides. You webcam or cell on your left and your mouse and number pad on your right. The cord that plug in from the Hub to the Computer is very sterdy yet flexible so you can not only adjust the Hub in all kind of angles, it would stay at that angle and not twist all around you wires. It also works great if you jsut want to charge you USB devices on the go. It come with a plug in AC adapter so you don't need to bring your computer along with you to charge youd devices","domain":"electronics","label":"positive"}
{"review":"I,ve seen complaints about the ac adapter you \"must\" plug in. Hey guys, try it without an outside energy source, I just hope I,m not gonna fry something but it seems to work fine just plugged into a powered USB port. I have a VERY high end system though with wattage to sprare, but no more PCI slots, Damn 7900 512 gtx graphics cards, why do 2 of em have to take up so much room. Oh well, trade offs are a bi---, but a reality and 7 extra USB slots are awfully nice","domain":"electronics","label":"positive"}
{"review":"This review pertains specifically to the Targus PAUH217U 4 Port Ultra Mini USB 2.0 Hub. The cord is about 2.5 feet long - long enough to reach from my pc, which sits on the ground, to the top of the desk. It has a cable which is split into two USB plugs - one just to transmit data, the second to power the unit. The second plug does not need to be used unless you plan on using some heavy-duty hardware, and if so what are you buying a hub called the ultra mini for anyways? If you insist on trying to run a blow dryer off the thing, then it does have an input for a separate power source, which you will have to buy separately. In short, If you have an old school machine with USB ports which are inaccessible /inconvenient to use, this little hub will give you quick access while taking up minimal space on your desk","domain":"electronics","label":"positive"}
{"review":"I would like to believe that this hub works well- but I wouldn't know.  I bought it to reduce clutter on my desk from all my devices hooking into my powermac.  I hooked up my printer, ipod and digital camera and nothing happened.  I called Targus and they said I needed an a/c adaptor.  It doesn't come with one and doesn't say anything about one in the manual or instructions, or their website.  They said I could get it at radio shack and gave me the info (5 volt, 2.1 amp, center positive).  I've been to two radio shacks and online- they don't carry it.  I'm upset.  Any advice","domain":"electronics","label":"negative"}
{"review":"It's speedy and space saving and inexpensive. I bought this to replace my Belkin because the Belkin needed to be plugged in. This one is powered by your computer so there's no extra power cords, which is a big plus to me. The only thing I dislike about this is the fact that the Hub takes up two Usb ports instead of just one like the Belkin.","domain":"electronics","label":"negative"}
{"review":"PROS Small Cute Self-powered - comes with a power adaptor.  I have 6 devices hooked up to it, including 2 USB Hard Drives, and it works fine without the adapter - a big plus for me. Most hubs would not work with this setup. USB 2.0 & 1.1 - 6 devices hooked up, 3 low speed and 3 high speed, all work very well. Runs cool. CONS Not sure why, but they put the 7 ports on one side of the hub and power/uplink ports on the other.  This is dumb.  If you have the hub on a desk it looks awkward.  All ports should be on the back and leds on the front.  Here, the leds are next to each port which makes them completely useless as you don't see them. The hub is very light so when you have lots of devices hooked up the font gets a elevated. Overall, the best hub I've ever had and I tried many","domain":"electronics","label":"positive"}
{"review":"It's a simple device, so there's not to say about it other than it does the job. You should note that the LEDs on the device remain lit as long as the device is plugged into your PC and the PC is powered (they glow a bright blue).","domain":"electronics","label":"positive"}
{"review":"You will appreciate this product only if you don't have enough USB ports. In my case, I had plenty of ports, but needed an extension cable, which would help me in plugging the flash drives, whithout bending down and plunging into the cave of wires(I keep my CPU, under the table).The only complaint I have is the the wire lenght is not long enough. Overall good value for price","domain":"electronics","label":"positive"}
{"review":"This hub takes care of old power issues I had with smaller (unpowered hubs).  It is handling my pda, usb jump drive, high capacity external drive, and printer.  And I still have 3 more ports.  And I haven't had any USB power alerts from my computer since I added this hub.  It does what it says","domain":"electronics","label":"positive"}
{"review":"This system is just what I wanted.  It is small, powerful and easy to us","domain":"electronics","label":"positive"}
{"review":"This truly was so easy to set up including programming all the wonderful features. The sound is fabulous and the unit is so compact and looks very nice.  I'm very happy with my purchase and the price was great too","domain":"electronics","label":"positive"}
{"review":"Wonderful sound and nice bass...small and compact.. easy directions to understand.. remote simple to use..just a great  complete uni","domain":"electronics","label":"positive"}
{"review":"I've had it for about 2 months already, and it has worked without any flaws. The only thing you have to be aware is to use good media to burn audio cds and MP3, because if not it will skip seconds while playing. But other than that, sound is perfect and it has lots of power for it's size.  You won't go wrong with Panasonic","domain":"electronics","label":"positive"}
{"review":"This Panasonic is all right, except I would die to get my old Sony system back.  They just don't have the sound quality at Panasonic that Sony had with these small systems.  I don't like that I don't have a clock display at all times and sometimes the CD changer is confusing to me, but it will just take time to figure it out.  Since these kind of bookshelf stereos are becoming more obsolete, I am happy to have this one.  With all the sound quality of the Sonys I have owned (I've gone through a half dozen) it will please me if this just hangs on and does not become a disappointment in functionality.  I would like this one to hang around longer.  Hopefully, the CD reader will not go out like my Sonys did","domain":"electronics","label":"positive"}
{"review":"Hands down, this is the best budget stereo system for the price. Period.","domain":"electronics","label":"positive"}
{"review":"I recently bought this stereo for my living room. I'm very very satisfied. It was pretty easy to set up. The sound is also very wonderful. The bass and treble features are great too. 5 disc changer is a plus. I recommend this product to anyone who's looking for a good stereo. *note- iPod users need to buy a line-in in order to plug their iPod into the music port.","domain":"electronics","label":"positive"}
{"review":"I bought this model in order to be rid of my almost-new Sony MHCEC70 with its faulty ergonomics and detestable tuner.  Having once owned an earlier PM-series model, this new Panasonic was the obvious choice and it does not disappoint.  Like its predecessor, the PM53 is a nice, powerful compact stereo with (for the money) ridiculously nice audio quality and a good tuner, especially on the FM band.  It can easily be turned up load enough to cause hearing damage and annoy neighbors in adjacent houses.  The remote covers every function and is easy enough to figure out without consulting the manual. Right now, this is the budget stereo of choice for the discerning.  Sony's competing models are cheesy-looking (hog attention on store shelves,) bigger (i.e., take more materials/cost more to ship,) and consequently suffer certain cost-cutting measures like the aforementioned crappy tuner and simplified (and of course, proprietary) antenna connector.  It's like choosing between the Pontiac and the Toyota.  The Sony is for the unwashed rubes who want 300 watts of mylar-coated bling.  The Panasonic is for people who want something that makes pleasant sounds and looks like the rest of the furniture.","domain":"electronics","label":"positive"}
{"review":"It was very easy to put together and takes up minimum space.  However, the sound is not minimal and is great for my needs.  I particularly like the equalizer for both my pop and classical music.  The radio, with the antenna, has great sound with little static.  The cd player is great for my needs; easy to play just one cd or the entire deck. My only quibble is that it has a single cassette deck and is not auto reversible.  But that's a small price for having a system with great sound. Instruction book, as most books are, could use a little ironing out but I was able to get started and if you have set up a shelf system before, this should be a breeze.  If you haven't set one up before, you should have no trouble","domain":"electronics","label":"positive"}
{"review":"I had high hopes for this mandoline, but I unfortunately have had to return it and, for the first time, I feel a certain responsibility to write a review.  The blades of this mandoline are dull, dull, dull.  When it arrived, I first tried slicing an onion, which actually was somewhat successful, although the slices were torn and uneven.  The carrot I then tried was more shredded than sliced. Forget tomatoes -- do not try tomatoes, period!  Unless you want tomato juice and there are easier ways to get tomato juice. This mandoline will definitely slice potatoes and cucumbers although the slices tend to be uneven, but perhaps I wasn't applying even pressure.  However, I haven't had this problem with my V slicer which, I guess, for now, I'll continue to use. My advice would be, don't buy this one.","domain":"housewares","label":"negative"}
{"review":"But at least you don't have to pay $150-200 for the pleasure of using this one. I'm a chef, and I've used dozens of mandolines over the years. This mandoline is as good as any, and much less expensive than \"pro\" types. I've actually found the plastic it's made of to be quite durable, and the blades seem to hold an edge well. Also, replacement blades are available for $9.00 each which most other models don't offer. I've got two of these which see heavy use, and when they break(in a restaurant, everything breaks sooner or later), I won't hesitate to buy the same model again. The holder is cumbersome, as are they all, but you need it when making straight slices. I would suggest buying a cut resistant glove and holding item to be sliced in your hand when making other types of cuts","domain":"housewares","label":"negative"}
{"review":"I bought this about two years ago and immediatly started using it. For a short period of time it worked just fine... and then everything started to stick to it. I finally through this in the garbage due to a coffee cake being stuck in there and not coming out, and no amount of cleaning would restore the pan. I will admit that I'm not a great cook, but I followed all the precautions for a non-stick pan and never overcooked anything. So, for me, this was a big letdown","domain":"housewares","label":"negative"}
{"review":"I grew up using my grandmother's cake pans and I still retain a deep fondness for them.  But I wanted something a little more professional, so I turned to Chicago Metallic, and was more than a little surprised at the difference in my cakes.  I've finally gotten that smooth, almost crumbless texture that is a joy to frost.  My cakes are more level now because I can bake them at a lower temperature, and the result is that the finished cakes really do look more professional.  I'm sold on this bakeware and plan on getting more pans, which is the highest recommendation I can give","domain":"housewares","label":"positive"}
{"review":"I have had two of these cake pans for a few years now, and I love them!  I've won awards for my cakes, so take my word for it, if you don't want to take a chance on ending up with a low quality pan, this is the one to purchase.  They do conduct the heat very well, so I do usually drop the temperature in my oven by about 5 degrees.  This allows the sides and the middle of the cake to rise at a more even rate, preventing a high rounded top. If you like to bake cakes, I highly recommend buying this pan","domain":"housewares","label":"positive"}
{"review":"This is a great machine. It did just what I wanted it to do which was to make soft, swirly ice cream out of regular ice cream.It could do one flavor on the bottom and one flavor on the top which I love! It was easy to make and use! I am lactose intolerant and I was able to use soy ice cream in this machine! That's especially why I love this machine! My sister's completely allergic to dairy but she can use this machine!","domain":"housewares","label":"positive"}
{"review":"Don't pay any attention to the truly uncoordinated people who tell you it takes two or more people to run this machine--I honestly can't figure out why it would! It couldn't be easier & the resulting treats couldn't be better!! Reading some of the reviews of this product just leaves me scratching my head...as such, I apologize for any cynicism you may detect in my review, but I feel the need to counter some of the misinformation out there (and I empathize with the Black & Decker reps who had to deal with some of these cranky people who are too inept to operate a rather simple tool). 1.  The \"ON\" switch does NOT need to be held down like a pulse-button--just turn it on & let go, people...this leaves your hands free to pick up the cone & fill it with the deliciously yummy treat coming out of the Arctic Twister.  When you're done, just turn it off again (see, now wasn't that easy?). 2.  The idea that it takes too long is hilarious, too.  Unless, of course, the 90-seconds it takes to assemble it & scoop in the ingredients is considered a lot of time (certainly not in my book, especially considering the fact that the results are WAY better than a DQ Blizzard).  I literally took this product out of the box the first time and was eating an awesome dessert in less than 2 minutes--without reading any directions for assembly or use--it is that simple of a product to figure out.  Clean up is a breeze, too.  It dismantles with the push of a button & it rinses in the sink, again, in just a few seconds (there are only three pieces to wash).  It is easy enough to use that it's not a big deal to reassemble it if someone wants seconds or more people pop in after you've taken it apart--it literally is one of the easiest & most fun food preparation products we own.  So the idea that jumping into a car & going to DQ for Blizzards would be somehow more efficient is outrageous (and the closest one to us is only 5 miles away).  It would truly take longer just to get our shoes on* & into the car than it would take to run the Arctic Twister! (* = I'm talking a family of four who all tie our own shoes--no other hindrances like diaper bags or anything.) 3.  Noisy?  Well, the thing DOES have a motor.  So does your blender, food processor, popcorn popper & hand mixer!  It's not like you're running this thing for any real length of time.  In my mind, if you can't handle a bit of noise from a product like this for all of 10-30 seconds, then you are missing the whole point of having a good time using a product that is meant to be fun.  Lighten up folks--life is wayyyyy too short! 4.  And, no, a regular ice cream scoop is NOT too big to use with this machine (when you see the size of the chute into which you place the ice cream, you'll find this a strange comment, too).  No special equipment needed here. 5.  Next, I can't imagine there is a kid out there (or many of us adults either) who wait for everyone in the room to have their cones in-hand before taking a lick of theirs...is there now a new etiquette to eating ice cream?  I wonder if the comment about waiting for everyone to be served was written by Emily Post (with ice cream dripping down her arm)!?  The laws of physics explain pretty well why ice cream melts the longer it is out of the freezer.  Therefore, mix it, serve it & eat it--no need to sit and admire it (although it IS pretty darn cool). 6. Finally, the comment about this product being too hard to use if you have arthritis is SO untrue...I have pretty severe arthritis in both my hands and my elbows and had NO PROBLEMS WHATSOEVER using this machine.  The most difficult part was scooping the ice cream from its original container--if you can do this part, you should be fine.  If you can't scoop it out & you don't have arthritis, then your freezer temperature is set too low or you should dip the scooper in hot water first.  However, once the ice cream is in the Arctic Twister and the motor is turned on, it begins to soften up--and one only needs to push the handle periodically and enough to advance the ice cream down toward the mixing assembly, but a lot of physical effort is not required since the motor does the work of mixing & churning the food.  Again, if I could do this without any pain, nearly anyone can. Truth be known, I agree with the comments that the design of this machine could be improved upon, since a fair amount of ice cream is not pushed through the machine (although we, too, have NO issues in licking the remains off the cone-shaped assembly--it's no different than licking the beaters when making a cake! Probably another lapse in the etiquette of our house ;) ).  It would probably be nice is there was a way the machine could extrude closer to 100% of the finished product.  But this is not enough to make me want to return the machine--and even less of an issue when serving a larger group of people, since the amount wasted remains the same whether making one cone or 50 cones & therefore becomes a relatively minor amount after numerous consecutive servings. I am very impressed that this little gadget is so great at pulverizing the mix-ins, especially in the absence of any sharp parts (there is nothing that could cut you whatsoever--all parts are plastic, but seem sturdy at the same time).  I half-expected the chocolcate chips to pose a problem because of their larger size and hard consistency; but they came out tiny & beautifully interspersed amid the Girl Scout Cookies, nuts, sprinkles and whatever else we added.  Versus DQ (and other ice cream places), it is nice that you can use as many ingredients as you want (and have a greater variety) without being charged 50 cents or whatever they charge for each one, you can vary the flavor of the base ice cream, and you don't have to pack everyone into the car and stand in long lines and even battle to find a place to sit.  The Arctic Twister is convenient and fun and, in short, I highly recommend it!  I decided to write a review because I was just about to buy one for my sister's kids for Easter this year and couldn't believe the amount of negative reviews about it.  I have no doubt they will love it as much as we do.","domain":"housewares","label":"positive"}
{"review":"The IC200 ice cream mixer is a one-trick pony. The only thing it's supposed to do is take hard ice cream and convert it into soft-serve, and this is does quite well. Setup is a snap, quite literally: just use the enclosed instructions to snap the pieces together. Although one of the pieces is pictured as a mirror image of itself, it's easy enough to figure out how it all goes together. Total assembly time: under five minutes, and that's only the first time. Once you've got the hang of it, thirty seconds is probably about right. Once you've got the mixer together, you just scoop your hard ice cream and any toppings into the top and flip the switch. The mixer starts turning while the user manually pumps the ice cream into the twister, just like a professional soft-serve machine. Within a minute or so, your soft-serve is dispensed, complete with any toppings you've mixed in. Make sure you use a bowl or a flat-bottomed cone, unless each person is going to hold his or her own cone; having both hands available makes it much easier to use. Now for the one real caveat: once all the ice cream has been pumped into the twister, there's still plenty left in there. Unless you disassemble the mixer immediately and scoop out the extra ice cream, you're going to lose about a cone's worth. Granted, this ice cream will be as soft as the rest, but it's not nearly as pretty and is sort of difficult to remove. Bottom line: if you're looking for good soft-serve ice cream (in any flavor you can find!), look no further. Just watch out for the overage in the twister, and you'll be good","domain":"housewares","label":"positive"}
{"review":"Did not find this ice cream mixer efficient.  It melted the ice cream and was too messy of a clean u","domain":"housewares","label":"negative"}
{"review":"I like this product.  It does a good job mixing up the ingredients.  Mine does seem to leek however","domain":"housewares","label":"positive"}
{"review":"It takes a lot of ice cream just to \"prime\" this thing and in the end you end up with a big mess and not much else.  I wouldn't recommend it and certainly wouldn't buy another","domain":"housewares","label":"negative"}
{"review":"I purchased this for my kids for a Christmas present. I think it is wonderful. It does NOT take two people to run the Arctic Twister unlike the reviews from others. It is easy to put together and easy to clean up. My whole family loves the ice cream that it makes. I guess maybe some of the unhappy people should just go to Dairy Queen..........","domain":"housewares","label":"positive"}
{"review":"I bought several sets of this for a recent pool party and as a 'test' to see how they look, feel and perform.  Everyone at the party thought they looked great, matched the decor, and worked well.  As far as cleaning, I chose to hand wash them all instead of putting them in the dishwasher so I can't comment yet on how they wash in the dishwasher although they are dishwasher-safe. Overall, a nice product and very reasonably priced.  If you want something more expensive looking try Alain Saint-Jonais mito true box wood (bamboo look) flatware.  It's beautiful but much more expensive!  I got several of their pieces as serving spoons, serving forks, punch ladles, carving knives, etc. to somewhat match this set from Cambridge.  Cambridge doesn't offer these pieces which is a downfall.  Other than that, very pleased","domain":"housewares","label":"positive"}
{"review":"I am thinking about picking up more of these glasses - I love them - love the design! They are absolutely beautiful.","domain":"housewares","label":"positive"}
{"review":"I bought these glasses as a Christmas gift, and my friends absolutely loved them! These glasses are very handsome, beautiful and fun. I am buying another set because my friends accidentally broke one and have been so bummed out about it","domain":"housewares","label":"positive"}
{"review":"A well-built pillow with a good fill count.  Fluffs nicely.  Better than other down pillows I've purchased in the past, and definitely good for the price","domain":"housewares","label":"positive"}
{"review":"I bought this as a gift two years ago after the reviews here, and Consumer Reports rated it a good buy.  It's good at first, but I've had hamsters that lived longer!  The shredding blade broke on the second use.  After about the 6th or 7th use, some kind of black material started flying out of the bottom, and then it died, with the mysterious burnt plastic smell everyone talks about.  I'm amazed there hasn't been a recall and I'm disappointed that B&D would sell such a poor quality product.  Just bought a new Cuisinart at Costco.  Spent more, but it is OUTSTANDING","domain":"housewares","label":"negative"}
{"review":"I bought this a year or so ago from Target for pretty cheap, and remember thinking \"I don't need one of those fancy expensive ones with all the different blades and options.... It's Black & Decker, I'm sure it'll be fine for just chopping up or pur\u001aeing stuff.\"  I was wrong. I tried to chop up frozen berries and it just stopped working. Most things I try to put in there cause it to stop working, actually. Even when it does work, it's so loud I find myself wondering if it's going to come apart on the counter.  Also, the plastic cracked in the dishwasher, and then a lot more using it to chop vegetables.  The only reason I'm on amazon.com right now is because I'm already shopping for a new (and better) one","domain":"housewares","label":"negative"}
{"review":"The processor works great.  My only complaint is that it doesn't shred cheese as fine as I would like","domain":"housewares","label":"negative"}
{"review":"For Christmas we asked for a food processor and were given the Black & Decker FP1500 Power Pro II. I was so happy for my wife as it would make her life so much easier. I read the instructions and we got ready to chop some veggies. My wife kept cutting everything small, I told her you don't need to cut everything so small. We placed small pieces in the processor and it continually stopped working. I was very frustrated by how little it took to stop the blades. This thing is going back and I will not be buying a Black and Decker. In the end it turned our excitement into major frustration","domain":"housewares","label":"negative"}